

nsh> ?
help usage:  help [-v] [<cmd>]

    .           cp          expr        pkill       ps          true
    [           cmp         false       losetup     put         truncate
    ?           dirname     fdinfo      ls          pwd         uname
    addroute    date        free        mkdir       rm          umount
    alias       delroute    get         mkfifo      rmdir       unset
    unalias     df          help        mkrd        route       uptime
    arp         dmesg       hexdump     mount       set         usleep
    basename    echo        ifconfig    mv          sleep       watch
    break       env         ifdown      nslookup    source      wget
    cat         exec        ifup        pidof       test        xd
    cd          exit        kill        printf      time        wait

Builtin Apps:
    buttons            iperf              ping6              telnetd
    dd                 leds               ping               udpblaster
    dumpstack          mdns               rand               udpclient
    example_telnetd    mdnsd_start        renew6             vi
    getprime           mdnsd_stop         renew              wapi
    gpio               mpc                sh                 webserver
    hostname           netcat             tcpclient
    i8                 nsh                tcpecho
    igmp               ostest             telnet
nsh> ifup wlan0
netdev_ifr_ioctl: cmd: 1818
I (479) phy_init: phy_version 1201,bae5dd99,Mar  3 2025,15:36:21
ifup wlan0...OK
nsh> wapi psk wlan0 "passwd" 3
netdev_ifr_ioctl: cmd: 35634
netdev_ifr_ioctl: cmd: 35634
netdev_ifr_ioctl: cmd: 35636
nsh> wapi essid wlan0 "ssid" 1
netdev_ifr_ioctl: cmd: 35610
nsh>
nsh> pkt_in: No PKT listener
eth_input: IPv4 frame
pkt_in: No PKT listener
eth_input: IPv4 frame
pkt_in: No PKT listener
eth_input: IPv4 frame
ipv4_in: WARNING: Not destined for us; not forwardable... Dropping!
pkt_in: No PKT listener
eth_input: IPv4 frame
pkt_in: No PKT listener
eth_input: IPv4 frame
pkt_in: No PKT listener
eth_input: IPv4 frame

nsh> pkt_in: No PKT listener
eth_input: IPv4 frame
renew wlan0
netdev_ifr_ioctl: cmd: 1812
dhcpc_open: MAC: f0:9e:9e:99:0f:b0
netdev_ifr_ioctl: cmd: 1793
dhcpc_request: Broadcast DISCOVER
udp_callback: flags: 0010
sendto_eventhandler: flags: 0010
udp_send: UDP payload: 265 (0) bytes
ipv4_build_header: IPv4 Packet: ipid:1, length: 293
udp_send: Outgoing UDP packet length: 293
pkt_in: No PKT listener
udp_callback: flags: 0010
udp_callback: flags: 0010
pkt_in: No PKT listener
eth_input: ARP frame
arp_in: ARP request for IP 402ba8c0
udp_callback: flags: 0010
pkt_in: No PKT listener
eth_input: ARP frame
arp_in: ARP request for IP 402ba8c0
udp_callback: flags: 0010
pkt_in: No PKT listener
eth_input: ARP frame
arp_in: ARP request for IP 402ba8c0
udp_callback: flags: 0010
pkt_in: No PKT listener
eth_input: IPv4 frame
udp_callback: flags: 0010
pkt_in: No PKT listener
eth_input: IPv4 frame
udp_callback: flags: 0002
udp_eventhandler: flags: 0002
udp_eventhandler: UDP done
udp_callback: flags: 0010
dhcpc_request: Received OFFER from c0a82b01
netdev_ifr_ioctl: cmd: 1794
dhcpc_request: Send REQUEST
udp_callback: flags: 0010
sendto_eventhandler: flags: 0010
udp_send: UDP payload: 272 (0) bytes
ipv4_build_header: IPv4 Packet: ipid:2, length: 300
udp_send: Outgoing UDP packet length: 300
pkt_in: No PKT listener
udp_callback: flags: 0010
udp_callback: flags: 0010
pkt_in: No PKT listener
eth_input: IPv4 frame
udp_callback: flags: 0002
udp_eventhandler: flags: 0002
udp_eventhandler: UDP done
udp_callback: flags: 0010
dhcpc_request: Received ACK
dhcpc_request: Got IP address 192.168.43.64
dhcpc_request: Got netmask 255.255.255.0
dhcpc_request: Got DNS server 192.168.43.1
dhcpc_request: Got default router 192.168.43.1
dhcpc_request: Lease expires in 3600 seconds
netdev_ifr_ioctl: cmd: 1794
netdev_ifr_ioctl: cmd: 1800
netdev_ifr_ioctl: cmd: 1796
netdev_ifr_ioctl: cmd: 1826
netdev_cell_ioctl: cmd: 1826
netdev_imsf_ioctl: cmd: 1826
net_ipv4_dumproute: Comparing:
net_ipv4_dumproute:   target=00000000 netmask=00000000 router=0a000001
net_del_ipv4route: With:
net_del_ipv4route:   target=00000000 netmask=00000000
netdev_ifr_ioctl: cmd: 1825
netdev_cell_ioctl: cmd: 1825
netdev_imsf_ioctl: cmd: 1825
net_ipv4_dumproute: New route:
net_ipv4_dumproute:   target=00000000 netmask=00000000 router=c0a82b01
nsh>
nsh>
nsh> renew6 wpkt_in: No PKT listener
nsh> renew6 wpkt_in: No PKT listener
eth_input: ARP frame
arp_in: ARP request for IP 402ba8c0
pkt_in: No PKT listener
lanpkt_in: No PKT listener
eth_input: IPv4 frame
netdev_ifr_ioctl: cmd: 1811
netdev_cell_ioctl: cmd: 1811
netdev_imsf_ioctl: cmd: 1811
netlib_obtain_ipv6addr: netlib_icmpv6_autoconfiguration fail
renew6_main: obtain ipv6addr fail
nsh> renew6 wlwan0
netdev_ifr_ioctl: cmd: 1811
netdev_cell_ioctl: cmd: 1811
netdev_imsf_ioctl: cmd: 1811
netlib_obtain_ipv6addr: netlib_icmpv6_autoconfiguration fail
renew6_main: obtain ipv6addr fail
nsh>
